<template>
  <div>
    <header class="sticky top-0 header">
      <div class="fade-in">
        «На авто по ВКО. Автотур твоей мечты»
      </div>
    </header>
    <main class="p-4">
      <div class="container">
        <div class="start">
          <h1>Введение</h1>
          <p class="text">
            Восточный Казахстан — это регион, который по праву считается одним из самых разнообразных и живописных уголков страны. <br>
            Его природа поражает своим величием и уникальностью.  <br>
            В туре «Красота Востока»  вы посетите самые живописные места нашего региона. <br>
            Он начинается в городе Усть-Каменогорск и закончится в Катон-Карагайскомнациональном парке.</p>
        </div>
        <!-- 1 -->
        <div class="flex-container"> 
          <div class="flex-item">
            <h2>
              Киин-Кериш. 
            </h2>
            <p>
              Урочище Киин-Кериш  - это вскрытые эрозией отложения пестроцветных, преимущественно красных, глин. <br>
              Эти яркие холмы похожи на языки пламени.
            </p>
          </div>
          <div class="flex-item">
            <img src="/1.1.jpg" alt="">
          </div>
          <div class="flex-item">
            <img src="/1.2.jpg" alt="">
          </div>
          <div class="flex-item">
            <div>
              <h2>
                Как проехать:
              </h2>
              <p>
                Выезд на самарскую трассу , движение в сторону Бухтарминского водохранилища (168км) <br>
                Переправа на пароме «КызылТу» <br>
                Путь в с. Курчум (60км) <br>
                120 км движение в сторону о.Балхаш. <br>
                Общее время в пути: 7 часов
              </p>
              <h2>
                Где остановится:
              </h2>
              <p>
                гостевой дом в с.Курчум 2500 тг в сутки + питание 
                Остановка в селе Курчум на одну ночь
                Картинка урочища 
              </p>
            </div>
          </div>
          <!-- 2 -->
          <div class="flex-item">
            <h2>
              Озеро Маркаколь 
            </h2>
            <p>
              Озеро Маркаколь — одно из самых красивых и уникальных озер Восточного Казахстана, расположенное в Маркакольском государственном природном заповеднике, в Алтайских горах. <br>
              Вода в озере кристально чистая. <br>
              Озеро Маркаколь также славится своей рыбалкой. 
            </p>
          </div>
          <div class="flex-item">
            <img src="/2.1.jpg" alt="">
          </div>
          <div class="flex-item">
            <img src="/2.2.jpg" alt="">
          </div>
          <div class="flex-item">
            <div>
              <h2>
                Как проехать:
              </h2>
              <p>
                Начало движения : Киин-Кериш <br>
                Выезд на трассу М-38 <br>
                Движение в сторону городов Кызылагаша <br>
                Или Керма.  <br>
                Далее движение в по указателям в с. Урунхайка <br>
                Общее время в пути:4-5 часов
              </p>
              <h2>
                Где остановится:
              </h2>
              <p>
                База отдыха «Айтума»  <br>
                коттедж - 120000 тг/сутки; <br>
                домики А-фрейм - 60000 тг/сутки; дом гостевого типа - 85000 тг/сутки с человека.
              </p>
            </div>
          </div>
          <!-- 3 -->
          <div class="flex-item">
            <h2>
              Староавстрийская дорога 
            </h2>
            <p>
              Староавстрийская дорога — это историческая дорога, расположенная в Восточно-Казахстанской области, в районе Алтайских гор, рядом с озером Маркаколь. <br>
              Дорога проложена через Алтайские горы и известна своими крутыми поворотами и узкими серпантинами. <br>
              Путешествуя по ней, вы подниметесь на значительную высоту, откуда открываются потрясающие виды на горные хребты и долины.
            </p>
          </div>
          <div class="flex-item">
            <img src="/3.1.jpg" alt="">
          </div>
          <div class="flex-item">
            <img src="/3.2.jpg" alt="">
          </div>
          <div class="flex-item">
            <div>
              <h2>
                Как проехать:
              </h2>
              <p>
                Урунхайка — Село Жамбыл:  <br>
                * Километраж: примерно 45 км. <br>
                * Время в пути: около 1 часа (зависит от состояния дороги, так как местные дороги могут быть не в лучшем состоянии). <br>
                * Трасса: из Урунхайки выезжаете на местную дорогу, ведущую в село Жамбыл. <br>
                2. Село Жамбыл — Староавстрийская дорога: <br>
                * Километраж: примерно 10-15 км до начала Староавстрийской дороги. <br>
                * Время в пути: около 20-30 минут (опять же, зависит от состояния дороги). <br>
                * Трасса: после Жамбыла двигайтесь по местной дороге, которая приведет вас к началу Староавстрийской дороги. <br> <br>

                Общее расстояния : 55-60км <br>
                Общее время в пути : 1.5 часа <br>
              </p>
            </div>
          </div>
          <!-- 4 -->
          <div class="flex-item">
            <h2>
              Катон-Карагайский национальный парк
            </h2>
            <p>
              У основания горы Сарымсакты, есть живописное место – село Катон-Карагай. <br>
              Местность поистине уникальна: здесь идеальным образом сочетаются горные вершины с чистейшими озерами, лесные массивы с альпийскими лугами, шумные реки с большими скалами.
            </p>
          </div>
          <div class="flex-item">
            <img src="/4.1.jpg" alt="">
          </div>
          <div class="flex-item">
            <img src="/4.2.jpg" alt="">
          </div>
          <div class="flex-item">
            <div>
              <h2>
                Как проехать:
              </h2>
              <p>
                1. Старт: Староавстрийская дорога (часть А-317). <br>
                2. Движение: Направляйтесь по А-317 в сторону Сорвенка. <br>
                3. Проезд через Сорвенок: Продолжайте движение по А-317. <br>
                4. Поворот на трассу: После Сорвенка продолжайте по А-348 в сторону Катон-Карагая.<br>
                5. Финиш: Катон-Карагай. <br>
                Километраж:<br>
                * Староавстрийская дорога до Сорвенка: примерно 60-70 км.<br>
                * Сорвенок до Катон-Карагая: около 80-90 км.<br>
                * Итого: примерно 150-160 км.<br>
                Время в пути:<br>
                * Весь путь займет около 3-4 часов в зависимости от дорожных условий.<br>
                Остановки для заправки и магазинов:<br>
                1. Заправка 1: В районе Сорвенка (примерно 60-70 км от Староавстрийки). Можно найти местные заправочные станции.<br>
                2. Магазины: В Сорвенке есть небольшие продуктовые магазины.<br>
                3. Заправка 2: В Катон-Карагае есть несколько заправок и магазинов.
              </p>
              <h2>
                Где остановится:
              </h2>
              <p>
                Эко-Отель «Музтау» на 3 суток +3х разовое питание номер стандарт 210000тг 
              </p>
            </div>
          </div>
          <!-- 5 -->
          <div class="flex-item">
            <h2>
              Усть-Каменогорск
            </h2>
            <p>
              После активного и полезного отдыха в этом месте, можно возвращаться домой, в город Усть-Каменогорск.
            </p>
          </div>
          <div class="flex-item">
            <img src="/5.3.jpg" alt="">
          </div>
          <div class="flex-item">
            <img src="/5.2.jpg" alt="">
          </div>
          <div class="flex-item">
            <div>
              <h2>
                Маршрут:
              </h2>
              <p>
                1. Старт: Катон-Карагай. <br>
                2. Выезд на трассу: Направляйтесь на А-348 в сторону Бухтармы. <br>
                3. Движение через Бухтарму: Проезжайте через Бухтарму, следуя указателям. <br>
                4. Съезд на трассу А-1: После Бухтармы двигайтесь на А-1, который ведет в сторону Усть-Каменогорска. <br>
                5. Финиш: Усть-Каменогорск. <br>
                Километраж: <br>
                * Катон-Карагай до Бухтармы: примерно 70-80 км. <br>
                * Бухтарма до Усть-Каменогорска: около 70-80 км. <br>
                * Итого: примерно 150-160 км. <br>
                Время в пути: <br>
                * Весь путь займет около 4-5часов, в зависимости от дорожных условий и трафика.
              </p>
              <h2>
                Остановки для заправки и магазинов:
              </h2>
              <p>
                1. Заправка 1: В Бухтарме. Здесь есть несколько заправочных станций, таких как Газпром и местные сети. <br>
                2. Магазины: В Бухтарме есть супермаркеты и продуктовые магазины, где можно сделать остановку для покупок. <br>
                3. Заправка 2: По пути на А-1 могут быть небольшие заправки, но лучше заправиться в Бухтарме   <br>
              </p>
            </div>
          </div>
        </div>
        <!-- 6 -->
        <div class="end">
          <img src="/6.jpg" alt="">
        </div>
      </div>
    </main>

    <footer class="sticky bottom-0 header">
      <div class="fade-in">
        «На авто по ВКО. Автотур твоей мечты» представляет собой уникальную возможность для путешественников открыть для себя удивительные природные и культурные богатства одного из самых живописных регионов Казахстана. <br>
        Автотуризм позволяет гибко планировать маршрут, посещать отдаленные уголки, такие как озеро Маркаколь, Рахмановские ключи и гору Белуха, и наслаждаться свободой передвижения. <br>
        Автомобильное путешествие в этом регионе — это не просто способ добраться до места, но и возможность постоянно любоваться величественными горными хребтами, реками и лесами по пути. 
      </div>
    </footer>
  </div>
</template>

<style>
  .header {
    display: flex;
    align-items: center;
    flex-direction: column;
    padding: 8px 0;
    background-color: #50C239;
    color: white;
    font-size: 28px;
  }
  .start {
    margin: 20px 0;
  }
  /* Анимация для плавного появления */
  .fade-in {
    opacity: 0;
    animation: fadeIn 1.2s ease forwards;
  }

  /* Ключевые кадры */
  @keyframes fadeIn {
    from {
      opacity: 0;
      transform: translateY(-10px);
    }
    to {
      opacity: 1;
      transform: translateY(0);
    }
  }
  .container {
    width: 100%;
    max-width: 1200px;
    margin: 0 auto;
    padding: 0 16px; /* добавим отступы, чтобы контент не прилипал к краям */
  }

  @media (max-width: 768px) {
    .container {
      max-width: 600px;
    }
  }

  @media (max-width: 480px) {
    .container {
      max-width: 320px;
    }
  }
  .flex-container {
  --gap: 60px;
  width: 100%;
  display: flex;
  flex-wrap: wrap;
  gap: var(--gap);
}

.flex-item {
  background: white;
  width: calc(50% - var(--gap) / 2);
  height: 450px;
}
.end {
  margin-top: 120px;
}
</style>
